openfoam_cases/ddof_channel/0.orig/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.651;

boundaryField
{
    // X0
    // {
    //     type            inletOutlet;
    //     inletValue      $internalField;
    //     value           $internalField;
    // }
    XL
    {
        type            inletOutlet;
        inletValue      $internalField;
        // value           $internalField;
    }
    top {
        type  zeroGradient;
    }

    "(border).*"
    {
        type            zeroGradient;
    }


    "(sym).*"
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
